# Location Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharedOperationProgressChangedEventArgs..::..Location Property
WorksharedOperationProgressChangedEventArgs Class See Also
---
Full path of the central model which is to be operated.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public string Location { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Location As String
	Get
```

Visual C++
---
```text
public:
property String^ Location {
	String^ get ();
}
```

# Remarks
For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.
# See Also
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace